list_a = []
for i in range(4): # iは0,1,2,3の値を取り、4回繰り返す
    list_a.append(2 * i) # list_aの末尾に2*iを追加する
    print(list_a) # [0, 2, 4, 6]

list_b = [21, 22, 23, 24]
list_c = []
for i in range(4):
    list_c.append(list_b[i] // (3 * (i + 1)))
print(list_c)

'''計算欄(26)
//は切り捨て除算
１回目のループ:21 // (3 * (0 + 1)) = 7
２回目のループ:22 // (3 * (1 + 1)) = 3
３回目のループ:23 // (3 * (2 + 1)) = 2
４回目のループ:24 // (3 * (3 + 1)) = 2
list_c = [7, 3, 2, 2]
'''

list_d = [2, 4, 1, 6, 9, 3, 5, 7]
d = 2
while d < 12:
    list_d.pop(11 % d) # 11 % d番目(インデックス)の要素を取り出して削除する
    d += 2
    print(list_d) # (27)

'''
計算欄(27)
dは+2なので2→4→6→8→10で推移
１回目のループ: 11%2=1 → [2, 1, 6, 9, 3, 5, 7] 4を削除
２回目のループ: 11%3=3 → [2, 1, 6, 3, 5, 7] 9を削除
３回目のループ: 11%6=5 → [2, 1, 6 , 3, 5]
４回目のループ: 11%8=3 → [2, 1, 6, 5]
５回目のループ: 11%10=1 → [2, 6, 5]
'''

list_e = [1, 2, 2, 7]
j = 0
for cd in [7, 3, 2, 6, 5]:
    if cd in list_e: # cdがlist_eにあるかチェック
        list_e.remove(cd) # 値がcdと一致する最初の要素を削除
        list_e.insert(j, 2 * cd) # インデックスjに値2*cdを挿入
        j += 1
print(list_e) # (28)

'''計算欄(28)
cd=7: list_e=[14, 1, 2, 2] 7を削除し、2*7=14をインデックス0にインサート。j=1
cd=3: list_eにないので、Falseとなり次のループへ
cd=2: list_e[14, 4, 1, 2] 最初の2を削除し、2*2=4をインデックス1にインサート。j=2
cd=6: list_eにないので、Falseとなり次のループへ
cd=5: list_eにないので、Falseとなりループ終了
'''

result = '' # 条件に応じた文字を順に連結するため空文字列で初期化
for e in [20, 6, -2, 12]: # eにリストの値を順に代入し、４回繰り返す
    if (e + 4) ** 2 < 30: # (e + 4)の2乗が30未満ならTrue
        result += 'A'
    elif 4 < e / 3: # 上の条件がFalseで、e / 3が4より大きければTrue
        result += 'B'
    else: # 上のifとelifの条件がどちらもFalseの場合に実行
        result += 'C'
print(result)

'''計算欄(29)
e=20: (20+4)**2=576 → 30未満ではない。20/3=6.666... → 4より大きい。 → B
e=6:  (6+4)**2=100  → 30未満ではない。6/3=2.0→4より大きくない→C
e=2:  (-2+4)**2=4   → 30未満。 →A
e=12: (12+4)**2=256 → 30未満ではない。12/3=4.0→C

'''